In [1]:
import pandas as pd
import numpy as np
%matplotlib inline

In [2]:
pd.__version__

'0.24.2'

In [3]:
np.__version__

'1.17.2'

## to_datetime

In [12]:
pd.to_datetime(12345, unit='D', origin='1960-01-01')

Timestamp('1993-10-19 00:00:00')

In [17]:
pd.to_datetime('2019-13-12', format='%Y-%d-%m') # December 13th, 2019

Timestamp('2019-12-13 00:00:00')

In [19]:
date = pd.to_datetime('December 13th, 2019')

In [20]:
date

Timestamp('2019-12-13 00:00:00')

In [22]:
date.strftime('%Y%m') # Extract the date back into a string

'201912'

In [23]:
 clients = pd.read_sas('./data/anagrf_srs_an.sas7bdat', encoding='unicode_escape')

In [24]:
clients.head()

  SEX TIPO_FINZ_GARN    DAT_NSC Klient_ID
0   M              1 1980-12-21  K_000001
1   Z              1 1986-12-29  K_000002
2   Z              2 1968-01-27  K_000003
3   Z              1 1982-10-22  K_000004
4   M              1 1984-10-19  K_000005

In [25]:
clients.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 4 columns):
SEX               100000 non-null object
TIPO_FINZ_GARN    100000 non-null object
DAT_NSC           100000 non-null datetime64[ns]
Klient_ID         100000 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 3.1+ MB

In [26]:
today = '2019-12-12'

In [29]:
date

Timestamp('2019-12-13 00:00:00')

In [36]:
date.month_name

In [37]:
today = pd.to_datetime('2019-12-12')

In [38]:
today

Timestamp('2019-12-12 00:00:00')

In [39]:
date

Timestamp('2019-12-13 00:00:00')

In [41]:
diff = date-today

In [48]:
diff.total_seconds()

86400.0

In [50]:
clients['Age'] = (today-clients['DAT_NSC'])

In [52]:
clients['Age'] = clients['Age'].apply(lambda date: date.days/365)

In [53]:
clients.head()

  SEX TIPO_FINZ_GARN    DAT_NSC Klient_ID        Age
0   M              1 1980-12-21  K_000001  39.000000
1   Z              1 1986-12-29  K_000002  32.975342
2   Z              2 1968-01-27  K_000003  51.909589
3   Z              1 1982-10-22  K_000004  37.164384
4   M              1 1984-10-19  K_000005  35.169863

## Date Time as index

In [54]:
clients.index

RangeIndex(start=0, stop=100000, step=1)

In [55]:
clients.index = clients['DAT_NSC']

In [57]:
clients.head()

           SEX TIPO_FINZ_GARN    DAT_NSC Klient_ID        Age
DAT_NSC
1980-12-21   M              1 1980-12-21  K_000001  39.000000
1986-12-29   Z              1 1986-12-29  K_000002  32.975342
1968-01-27   Z              2 1968-01-27  K_000003  51.909589
1982-10-22   Z              1 1982-10-22  K_000004  37.164384
1984-10-19   M              1 1984-10-19  K_000005  35.169863

In [59]:
clients.head()

           SEX TIPO_FINZ_GARN Klient_ID        Age
DAT_NSC
1980-12-21   M              1  K_000001  39.000000
1986-12-29   Z              1  K_000002  32.975342
1968-01-27   Z              2  K_000003  51.909589
1982-10-22   Z              1  K_000004  37.164384
1984-10-19   M              1  K_000005  35.169863

In [71]:
clients.loc['1984-10-19':'December 31st, 1984', ['Klient_ID', 'Age']].head()

           Klient_ID        Age
DAT_NSC
1984-10-19  K_000005  35.169863
1984-11-19  K_000081  35.084932
1984-10-24  K_000135  35.156164
1984-10-25  K_000156  35.153425
1984-12-12  K_000169  35.021918

In [74]:
clients['1984'].head()

           SEX TIPO_FINZ_GARN Klient_ID        Age
DAT_NSC
1984-10-19   M              1  K_000005  35.169863
1984-05-26   M              1  K_000011  35.569863
1984-11-19   M              1  K_000081  35.084932
1984-08-09   M              1  K_000106  35.364384
1984-03-13   M              1  K_000120  35.772603

In [76]:
clients.sort_index(inplace=True)

In [81]:
clients.truncate(after='24/12/1986').head() #before / after

           SEX TIPO_FINZ_GARN Klient_ID         Age
DAT_NSC
1910-07-14   M              2  K_053918  109.487671
1917-03-29   M              1  K_098669  102.775342
1921-02-02   Z              1  K_099213   98.923288
1921-12-07   Z              1  K_008788   98.079452
1923-07-03   Z              1  K_041837   96.509589

In [91]:
clients.resample('10Y')['Klient_ID'].count()

DAT_NSC
1910-12-31        1
1920-12-31        1
1930-12-31       80
1940-12-31     1474
1950-12-31    10096
1960-12-31    18958
1970-12-31    23406
1980-12-31    30515
1990-12-31    15398
2000-12-31       70
2010-12-31        1
Freq: 10A-DEC, Name: Klient_ID, dtype: int64

In [101]:
clients.resample('10Y')['Age'].ohlc() # .first(), .max(), .min(), .last()

                  open        high         low       close
DAT_NSC
1910-12-31  109.487671  109.487671  109.487671  109.487671
1920-12-31  102.775342  102.775342  102.775342  102.775342
1930-12-31   98.923288   98.923288   89.013699   89.013699
1940-12-31   88.978082   88.978082   79.019178   79.019178
1950-12-31   78.991781   78.991781   68.994521   68.994521
1960-12-31   68.991781   68.991781   58.986301   58.986301
1970-12-31   58.983562   58.983562   48.980822   48.980822
1980-12-31   48.978082   48.978082   38.972603   38.972603
1990-12-31   38.969863   38.969863   28.969863   28.969863
2000-12-31   28.964384   28.964384   27.386301   27.386301
2010-12-31   14.797260   14.797260   14.797260   14.797260

In [102]:
clients.head()

           SEX TIPO_FINZ_GARN Klient_ID         Age
DAT_NSC
1910-07-14   M              2  K_053918  109.487671
1917-03-29   M              1  K_098669  102.775342
1921-02-02   Z              1  K_099213   98.923288
1921-12-07   Z              1  K_008788   98.079452
1923-07-03   Z              1  K_041837   96.509589

In [103]:
clients.shift(-1).tail()

            SEX TIPO_FINZ_GARN Klient_ID        Age
DAT_NSC
1991-12-12    M              2  K_099995  27.580822
1992-05-20    M              1  K_093111  27.506849
1992-06-16    M              1  K_093016  27.386301
1992-07-30    Z              1  K_048097  14.797260
2005-02-27  NaN            NaN       NaN        NaN

In [104]:
(clients['Age']-clients['Age'].shift(1))/clients['Age']

DAT_NSC
1910-07-14         NaN
1917-03-29   -0.065311
1921-02-02   -0.038940
1921-12-07   -0.008604
1923-07-03   -0.016266
1923-07-05   -0.000057
1923-08-15   -0.001165
1924-10-24   -0.012548
1924-11-11   -0.000518
1924-11-16   -0.000144
1924-12-22   -0.001038
1925-02-09   -0.001415
1925-02-18   -0.000260
1925-03-07   -0.000491
1925-06-21   -0.003072
1925-06-29   -0.000232
1925-10-14   -0.003111
1925-10-18   -0.000116
1926-01-21   -0.002770
1926-07-20   -0.005277
1926-07-31   -0.000323
1926-09-19   -0.001468
1926-10-17   -0.000823
1926-11-20   -0.001000
1926-12-14   -0.000707
1927-06-25   -0.005715
1927-09-09   -0.002255
1927-10-06   -0.000802
1927-10-16   -0.000297
1927-11-02   -0.000505
                ...
1991-06-11   -0.000384
1991-06-13   -0.000192
1991-06-24   -0.001058
1991-06-28   -0.000385
1991-06-29   -0.000096
1991-06-30   -0.000096
1991-07-03   -0.000289
1991-07-03    0.000000
1991-07-03    0.000000
1991-07-07   -0.000385
1991-08-05   -0.002800
1991-08-07   -0.000193
1991-08-09   -0.000193
1991-08-14   -0.000483
1991-08-16   -0.000193
1991-08-24   -0.000774
1991-08-29   -0.000484
1991-08-29    0.000000
1991-08-31   -0.000194
1991-08-31    0.000000
1991-10-15   -0.004375
1991-10-18   -0.000292
1991-11-23   -0.003514
1991-11-25   -0.000195
1991-12-09   -0.001369
1991-12-12   -0.000293
1992-05-20   -0.015894
1992-06-16   -0.002689
1992-07-30   -0.004402
2005-02-27   -0.850768
Name: Age, Length: 100000, dtype: float64

## Dealing with missing values in time series

In [119]:
time_index = pd.date_range('01/01/2019', periods=5, freq='MS')

In [120]:
time_index

DatetimeIndex(['2019-01-01', '2019-02-01', '2019-03-01', '2019-04-01',
               '2019-05-01'],
              dtype='datetime64[ns]', freq='MS')

In [121]:
df = pd.DataFrame(index=time_index)

In [122]:
df['Sales'] = [1.0, 2.0, np.nan, np.nan, 5.0]

In [123]:
df.head()

            Sales
2019-01-01    1.0
2019-02-01    2.0
2019-03-01    NaN
2019-04-01    NaN
2019-05-01    5.0

In [124]:
df.interpolate()

            Sales
2019-01-01    1.0
2019-02-01    2.0
2019-03-01    3.0
2019-04-01    4.0
2019-05-01    5.0

In [125]:
df.ffill()

            Sales
2019-01-01    1.0
2019-02-01    2.0
2019-03-01    2.0
2019-04-01    2.0
2019-05-01    5.0

In [126]:
df.bfill()

            Sales
2019-01-01    1.0
2019-02-01    2.0
2019-03-01    5.0
2019-04-01    5.0
2019-05-01    5.0

In [134]:
df.interpolate(limit=2, limit_direction='backward', method='polynomial', order=2)

               Sales
2019-01-01  1.000000
2019-02-01  2.000000
2019-03-01  2.923185
2019-04-01  3.967379
2019-05-01  5.000000

In [132]:
df.fillna(method='pad')

            Sales
2019-01-01    1.0
2019-02-01    2.0
2019-03-01    2.0
2019-04-01    2.0
2019-05-01    5.0